#include "Square.h"
 // כיכר - ריבוע
Square::Square(double up, double down, double right, double left, const char* sn) :Quad(up,down,right,left,sn) //נאתחל קודם את האבא  "מרובע "שיורשים - נשלח לו ערכים שהוא צריך לקבל בבנאי , כנשגיע אליו אנחנו רואים שגם לאבא יש אבא - "צורה " לכן קודם צריך לאתחל את הסבא ואז את האבא אבל כששלחנו לאבא פרמטרים לבנאי הוא קודם יעבור לבנאי של הסבא  עם פרמטרים מתאימים לבנאי  ואתחול מתאים של הבנאי לאחר מכן יאותחל האבא בעצמו ואז נעבור לאתחול של המחלקה הנוכחית  

{
	// אין משתנים במחלקה זאת , לכן אין אתחול למחלקה
}

Square::~Square()
{
	//   אין הקצאות דינמיות למחלקה זאת לכן אין מה לרשום בהרסן 
}

void Square::shiftX(int x) 
{
	m_centerPoint.setX(m_centerPoint.getX() + x);   // נתאחל את הסנטר לפי איקס - יש לנו גישה כי זה פרוטקטד ומי שירש יכול לגשת
}

void Square::shiftY(int y)  
{
	m_centerPoint.setY(m_centerPoint.getY() + y);   // נתאחל את הסנטר לפי ואי - יש לנו גישה כי זה פרוטקטד ומי שירש יכול לגשת
}
